[
    {
        "id": "1",
        "title": "Punjabi Kadhi",
        "description": "Punjabi Kadhi sans pakoda is made with chickpea flour, yogurt, and spices. This slightly tangy and delicious dish is also known as Kadhi Chawal.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "45 mins",
        "difficultyLevel": "Modarate"
        
        "ingridients": [
            "For chickpea flour (besan) mixture",
            "1 cup chickpea flour/besan",
            "2 cups yogurt",
            "4 cups water",
            "pinch of turmeric powder",
            
            "For the kadhi",
            "11/2 tbsp avocado oil",
            "1/2 tsp turmeric powder",
            "1/4 tsp asafoetida/hing for gluten-free, use GF hing",
            "1 tsp mustard seeds",
            "1 tsp cumin seeds",
            "1/2 tsp fenugreek seeds methi",
            "3 cloves",
            "1 dry red chili",
            "12 curry leaves",
            "1 large red onion sliced",
            "1 inch piece ginger chopped",
            "4 cloves garlic chopped",
            "1/2 tsp chili powder",
            "2 tsp coriander powder",
            "3/4 tsp salt (season kadhi) + a little salt (for onions)",
            "add chickpea flour (besan) mixture",
            "1-2 cups water (optional.. for thinner gravy)",
            "1/2 tsp garam masala",
            "2 tsp mango powder amchoor",
            "2 tsp dry fenugreek leaves/kasoori methi",
            
            "For the tadka/tempering",
            "1 tbsp avocado oil",
            "2 dry red chilies",
            "1/2 tsp Kashmiri red chili or paprika",
            
            "For garnish",
            "fresh cilantro leaves",
            "pour tadka/tempering on top"
        ],
        
        "procedure": [
            "For chickpea flour (besan) mixture",
            "Mix the chickpea flour and yogurt together to get rid of lumps, then add water.",
            "Use a whisk to mix well.",
            "Add a pinch of turmeric powder. Set aside for 1/2 hour.",
            "Slice the onions. Chop the ginger and garlic.",
            "Set aside the spices - curry pata, hing, turmeric powder, cumin seeds, cloves, fenugreek seeds, mustard seeds, and one dry red chili.",
            
            "For the kadhi",
            "Heat up a pot on medium heat, once hot, add oil.",
            "Add the spices, saute for 30 seconds.",
            "Add the ginger and garlic. Saute for 30-45 seconds.",
            "Now add the onions. Saute for 3 minutes.",
            "Add red chili powder, coriander powder, and a little salt to season the onions. Stir.",
            "Slowly pour the besan-yogurt-water mixture to avoid curdling.",
            "Stir, season with 3/4 tsp of salt, and cook on medium heat for about 5 minutes - until the kadhi starts boiling away.",
            "This is what you should have 5 minutes later, the kadhi will get thick.",
            "Cover with a lid and cook the kadhi for 15 minutes on low-medium heat.",
            "This is what you should have. Taste and adjust seasonings if need be. Add more water if you prefer your kadhi thinner (1-2 cups max).",
            "Add mango powder, dry fenugreek leaves, and garam masala. Stir and turn off the stove.",
            
            "For the tadka/tempering",
            "Heat up a pan on medium heat. Once hot, add oil followed by dry red chilies and Kashmiri chili powder. Cook for about 1-2 minutes max. Turn off the stove.",
            "Pour tadka over kadhi and garnish with fresh cilantro leaves."
        ],
        
        "healthPreference": "Gluten free",
        "calories": "247kcal",
        "carbohydrates": "25g",
        "protein": "10g",
        "fat": "13g"
    },
    
    {
        "id": "2",
        "title": "Dal Makhani",
        "description": "This Dal Makhani recipe is a restaurant style version with subtle smoky flavors and creaminess of the lentils. Dal Makhani is one of the most popular lentil recipes from the North Indian cuisine made with whole urad dal (black gram) and kidney beans.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "9 hours",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "For chickpea flour (besan) mixture",
            "¾ cup whole urad dal , 140 grams (whole black gram)",
            "¼ cup rajma , 40 grams (kidney beans)",
            "3 cups water for pressure cooking , 750 ml water",
            "½ cup finely chopped onions , 50 grams onion or 1 medium sized onion",
            "1 teaspoon chopped green chilies or serrano peppers or 1 to 2 green chillies",
            "2 teaspoons Ginger-Garlic Paste or 6 to 7 small to medium-sized garlic + 1 inch ginger – crushed to a paste in mortar-pestle",
            "2 large tomatoes , 200 grams tomatoes – pureed or 1 cup tomato puree",
            "½ teaspoon cumin seeds",
            "2 to 3 cloves",
            "2 to 3 green cardamoms",
            "1 black cardamom",
            "1 inch cinnamon",
            "1 small to medium tej patta (Indian bay leaf)",
            "½ teaspoon red chili powder or cayenne pepper or smoked paprika",
            "2 to 3 pinches grated nutmeg or ground nutmeg powder",
            "1 cup water or add as required",
            "¼ to ⅓ cup low fat cream or half and half or 2 tablespoons heavy cream or",
            "¼ teaspoon crushed kasuri methi (dry fenugreek leaves) – optional",
            "3 tablespoon Butter – salted or unsalted",
            "salt as required",
            
            "1 to 2 tablespoons chopped coriander leaves (cilantro)","
            "½ tablespoon low fat cream or half and half for garnish – optional",
            "1 inch ginger julienne – optional"
        ],
        
        "procedure": [
            "Soak both the whole urad dal and rajma overnight in enough water for 8 to 9 hours or overnight. Later drain them well.",
            "Rinse both the lentils a couple of times in water.",
            "Drain again and then add them in a 3 litre pressure cooker. Add water and stir well.",
            "Pressure cook for 18 to 20 whistles on a high flame, till both the urad dal and rajma have cooked thoroughly and softened. If they are not cooked, then add about ½ cup water again and pressure cook for 4 to 5 whistles more.",
            "The urad dal should melt in the mouth and should not give any bite or resistance when eaten. You can also just mash the urad dal with a spoon or with your fingers to check the doneness. The same rule applies for rajma too. Keep the cooked beans aside.",
            "In a blender or mixer jar, take chopped tomatoes and blend to a smooth puree. Set aside.",
            "You can also add ready 1 cup tomato puree instead of blending the tomatoes. No need to blanch the tomatoes while pureeing.",
            
            "In a pan, now heat butter. You can use salted butter or unsalted butter.",
            "Add the whole spices – cumin seeds, cloves, green cardamoms, black cardamom, 1 inch cinnamon, 1 small to medium tej patta.",
            "Fry for some seconds till the spices sputter and become aromatic.",
            "Add finely chopped onions.",
            "Stir and sauté the onions on a low or medium-low heat often till they become light golden.",
            "Add the ginger garlic paste. Stir again and sauté for some seconds till the raw aroma of ginger-garlic goes away.",
            "Add the chopped green chilies and sauté for a minute.",
            "Add the prepared tomato puree and mix well.",
            "Add red chili powder and 2 to 3 pinches of grated nutmeg or nutmeg powder.",
            "Stir very well and sauté this mixture on a low to medium flame, till you see fat releasing from the sides.",
            "Then add the cooked urad dal and rajma beans along with the stock. Also add 1 cup water or as required.",
            
            "Stir very well and simmer the dal makhani uncovered on a low flame.",
            "Keep on stirring often, so that the lentils don’t stuck to the bottom of the pan.",
            "Once it has begun to thicken, add salt as required.",
            "Stir very well and continue to simmer on a low flame. Keep on stirring when the lentils are simmered on low heat.",
            "When simmering you can add more water if the gravy looks thick or dry. The longer you keep dal makhani to simmer, the better it tastes.",
            "I kept it for about an overall 25 minutes on a low flame. Do keep on stirring at intervals.",
            "When the gravy has thickened enough, then add cream. Dal makhani is not too thick or too thin. It has a medium consistency.",
            "Mix the cream very well. Then switch off the heat.",
            "Add crushed kasuri methi (dried fenugreek leaves). Mix again.",
            "Cover and set dal makhani aside, if you are proceeding to the dhungar method. Or else you can serve dal makhni straight away.",
            
            "Heat a small piece of charcoal on flame till it becomes red hot. With the help of tongs, keep on turning the charcoal piece so that it evenly burns.",
            "Keep the red hot charcoal in a small bowl.",
            "Pour ½ teaspoon oil on the hot charcoal.",
            "Immediately keep this bowl on top of the dal makhani.",
            "Cover for a minute and allow the charcoal to infuse its smoke in the dal makhni. Remove the bowl. Stir again.",
            "Serve punjabi dal makhani garnished with chopped coriander leaves (cilantro) and a few teaspoons of cream with naan, roti, paratha or steamed rice."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "308kcal",
        "carbohydrates": "35g",
        "protein": "13g",
        "fat": "13g"
    },
    
    {
        "id": "3",
        "title": "Sarson Ka Saag",
        "description": "The combo of sarson ka saag topped with butter and served with makki ki roti taste too good and is a winter staple in north India. It's commonly served over flatbread, such as makki ki roti (Indian maize flatbread), as well as a dollop of fresh butter.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "4 hours",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 bunch mustard leaves (sarson)",
            "½ bunch bathua leaves (chenopodium)",
            "½ bunch spinach leaves",
            "1 cup chopped tender radish leaves (mooli ke patte)",
            "2 to 3 inches white radish root",
            "1 cup fenugreek leaves, chopped",
            "2 medium sized onions, chopped",
            "3 medium sized tomatoes, chopped",
            "2 inch ginger, chopped",
            "2 green chilies, chopped",
            "7 to 8 garlic, chopped",
            "½ teaspoon red chili powder",
            "1 to 2 pinch asafoetida or ¼ teaspoon asafoetida powder (hing)",
            "2 to 3 cups water",
            "2 tablespoon maize flour",
            "salt as required",
            
            "1 medium sized onion, finely chopped",
            "1 to 2 tablespoon oil",
            "3 bowls of cooked saag"
        ],
        
        "procedure": [
            "Firstly clean and chop all the greens. then wash the greens well.",
            "In a pressure cooker or pan add all the ingredients listed under saag except for maize flour.",
            "Cover the pressure cook and cook for 6-7 minutes or more.",
            "If cooking in a pan, then cover and let the greens cook till done. Do check occasionally.",
            "Pour the greens along with the stock and maize flour in a blender. blend till smooth.",
            "In another pan, pour the pureed greens.",
            "Simmer for a good 25-30 minutes.",
            
            "In another small pan, heat oil or ghee",
            "Add the chopped onions and fry them till light brown.",
            "Add the prepared saag. Stir and simmer for a couple of minutes.",
            "Stir ocaasionally.",
            "Serve sarson ka saag hot with some chopped onions, whole green chilies and a dollop of butter on the saag with makki di roti"
        ],
        
        "healthPreference": "",
        "calories": "159kcal",
        "carbohydrates": "13g",
        "protein": "5g",
        "fat": "11g"
    },
    
    {
        "id": "4",
        "title": "Chole Bhature",
        "description": "Chole Bhature also known as Chana Bhatura is one of the most popular Punjabi dish liked almost all over India. Chole stands for a spiced tangy chickpea curry and Bhatura is a soft and fluffy fried leavened bread.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "9 hours 30 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 cup dried white chickpeas [canned chickpeas can also be used]",
            "water as required for soaking",
            "¼ teaspoon salt",
            "3 cups water for pressure cooking",
            "a pinch or two of baking soda - optional",
            
            "2 to 3 tablespoon oil or ghee",
            "½ teaspoon turmeric powder",
            "¼ teaspoon red chilli powder",
            "1 teaspoon coriander powder",
            "1 pinch asafoetida (hing) - optional",
            "½ or 1 teaspoon dry mango powder (amchur powder)",
            "1 to 1.5 cups water to be added later",
            "salt as required",
            "1 green chilli (hari mirch) - slit",
            "1 teaspoon Garam Masala Powder or chole masala",
            
            "1 teaspoon cumin seeds",
            "1 large tej patta (indian bay leaf)",
            "2 inch cinnamon",
            "2 to 3 cloves",
            "2 green cardamom",
            "2 to 3 black peppercorns",
            
            "1 medium size onion - chopped",
            "2 medium size tomatoes - chopped",
            "1 inch ginger - chopped",
            "4 to 5 medium sized garlic cloves - chopped",
            "1 green chili - chopped",
            
            "1.5 cups maida (all-purpose flour)",
            "⅓ cup fine sooji (rava or fine semolina)",
            "½ tablespoon oil or ghee",
            "½ tablespoon fine granulated sugar",
            "½ teaspoon salt or as required",
            "¼ or ½ teaspoon baking soda",
            "½ cup Curd (yogurt)",
            "water - as required for kneading",
            "oil - for deep frying as required"
        ],
        
        "procedure": [
            "Rinse the white chickpeas for a couple of times in water. Then soak the chickpeas in enough water overnight or for 7 to 8 hours.",
            "Next day drain all the water and cook the chickpeas with water+salt in a pressure cooker or a pot.",
            "You can also add a pinch or two of baking soda while cooking the chickpeas.",
            "Drain the water and keep the chickpeas aside.",
            
            "In a grinder or blender take 1 medium sized chopped onion, 2 medium sized chopped tomatoes, 1 inch chopped ginger, 4 to 5 garlic cloves and 1 chopped green chili.",
            "Grind or blend to a fine paste.",
            "No need to add water while making the paste as the juice of the tomatoes will help in making the paste.",
            "Keep the paste aside.",
            "Heat 2 to 3 tablespoons oil in a pan or kadai/wok.",
            "Add the whole garam masala (spices) - 1 teaspoon cumin seeds, 1 large tej patta, 2 inch cinnamon, 2 to 3 cloves, 2 green cardamom and 2 to 3 black peppercorns.",
            "Fry the whole garam masala mentioned above till the oil become fragrant. But don't burn them.",
            "Add the ground paste and saute till the oil starts to leave the sides of the masala paste.",
            "Keep stirring often. Sauté for 8 to 10 minutes or more till the oil starts to leave the sides of the masala paste and the paste thickens and becomes glossy. Stir while sautéing so that the paste does not stick to the pan.",
            "Next add all the dry spice powders - ½ teaspoon turmeric powder (haldi), ¼ teaspoon red chili powder, 1 teaspoon coriander powder (dhania powder), 1 pinch asafoetida (optional) and ½ or 1 teaspoon dry mango powder (amchur).",
            "Mix very well and saute for a minute or two. Now add the cooked chickpeas and stir.",
            "Add 1 to 1.5 cups water or add as required. Also add salt as per taste and mix well.",
            "Simmer the gravy on a low or medium flame for 12 to 15 minutes or till the curry thickens. Don't cover the pan. Stir occasionally.",
            "Mash a few chickpeas with the back of spoon. This helps in thickening the gravy.",
            "Lastly add 1 slit green chili and 1 teaspoon garam masala powder or chole masala powder. Mix well and simmer for a minute or two.",
            "Check the seasoning and add more salt or spice powders if required. Garnish the curry with coriander leaves.",
            "You can also garnish with some slit green chilies and ginger julienne.",
            "Serve chickpea curry with onion slices, lemon wedges along with bhatura. Enjoy the chickpea curry with bhature.",
            
            "Using a sieve, sift the maida (all-purpose flour), salt and baking soda in a mixing bowl. Then add the semolina and sugar to the sifted ingredients.",
            "Now to the sifted ingredients, add the curd (yogurt). Mix very well with a spoon.",
            "Adding water in parts first mix and then knead to a smooth and soft dough.",
            "Cover the dough with a wet cotton napkin and let it rest for 2 hours.",
            "After 2 hours, pinch medium-sized balls from the dough.",
            "Roll the dough piece to a neat ball between your palms. Place the dough ball on your work surface and press it lightly with your fingers. Spread a bit of oil on both sides of the dough. Using a rolling pin, roll the dough ball into an oval or elongated shape. You can also make a round circle.",
            "In a pan or kadai heat oil on medium-high heat for deep frying. Drop the rolled dough in hot oil and it will quickly start puffing in the oil.",
            "When the sizzling of the oil stops, turn over the bhatura and fry the other side. You can flip once or twice for even cooking.",
            "When light golden or golden, remove the bhatura and drain on paper towels to remove excess oil. Roll and fry all bhaturas this way.",
            "Serve the hot puffed up Bhatura with the chickpea curry."
            
        ],
        
        "healthPreference": "",
        "calories": "646kcal",
        "carbohydrates": "90g",
        "protein": "19g",
        "fat": "24g"
    },
    
    {
        "id": "5",
        "title": "Paneer Butter Masala",
        "description": "Paneer Butter Masala is one of India’s most popular paneer gravy recipe. This recipe with Indian cottage cheese cubes in a creamy tomato sauce.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "40 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "8 to 20 whole cashews",
            "⅓ cup hot water for soaking cashews",
            
            "2 cups diced tomatoes or 300 grams tomatoes or 4 to 5 medium size – pureed",
            
            "1 inch ginger",
            "3 to 4 medium -sized garlic cloves",
            
            "2 tablespoons Butter or 1 tablespoon oil + 1 or 2 tablespoons butter",
            "1 tej patta (Indian bay leaf) – optional",
            "½ to 1 teaspoon kashmiri red chili powder or deghi mirch or ¼ to ½ teaspoon cayenne pepper or paprika",
            "1.5 cups water or add as required",
            "1 inch ginger – julienned, reserve a few for garnish",
            "1 or 2 green chili – slit, reserve a few for garnish",
            "200 to 250 grams Paneer (Indian cottage cheese) – cubed or diced",
            "1 teaspoon kasuri methi (dry fenugreek leaves) – optional",
            "½ to 1 teaspoon garam masala or tandoori masala",
            "2 to 3 tablespoons low-fat cream or half & half or 1 to 2 tablespoons heavy cream – optional",
            "¼ to 1 teaspoon sugar – optional, add as required depending on the sourness of the tomatoes",
            "salt as required",
            
            "1 to 2 tablespoons chopped coriander leaves (cilantro ) – optional",
            "a few ginger julienne",
            "1 tablespoon low fat cream or 1 tablespoon heavy cream – optional",
            "1 to 2 teaspoons Butter – optional"
        ],
        
        "procedure": [
            "Soak cashews in a hot water for 20 to 30 minutes. When the cashews are soaking, you can prep the other ingredients like chopping tomatoes, preparing ginger-garlic paste, slicing paneer etc.",
            "Then drain and add the soaked cashews in a blender or mixer-grinder.",
            "Add 2 to 3 tablespoons water and blend to a smooth paste without any tiny bits or pieces of cashews.",
            "In the same blender add the roughly chopped tomatoes. No need to blanch the tomatoes before blending.",
            "Blend to a smooth tomato puree. Keep aside. Don’t add any water while blending the tomatoes.",
            
            "Melt butter in a pan on a low flame. Add tej patta and fry for 2 to 3 seconds or till the oil become fragrant.",
            "Add ginger-garlic paste and sauté for some seconds till the raw aroma disappears.",
            "Add the tomato puree and stir well. Cook for 5 to 6 minutes. Then add kashmiri red chili powder and stir again. Continue to sauté till the oil starts to leave the sides of the tomato paste. The tomato paste will thicken considerably and will start coming together as one whole lump.",
            "Then add cashew paste and stir well. Sauté the cashew paste for a few minutes till the oil begins to leave the sides of the masala paste.",
            "The cashew paste will begin to cook fast. Approx 3 to 4 minutes on a low flame. So keep stirring non-stop.",
            
            "Add water and mix very well. Simmer on a low flame.",
            "The curry will come to a boil.",
            "After 2 to 3 minutes of boiling, add ginger julienne. Reserve a few for garnishing. The curry will also begin to thicken.",
            "Add julienned ginger and green chillies, salt and sugar and simmer till the curry begins to thicken.",
            "After 3 to 4 minutes, add slit green chillies. also add salt as per taste and ½ to 1 teaspoon sugar (optional).",
            "You can vary the sugar quantity from ¼ tsp to 1 teaspoon or more depending on the sourness of the tomatoes. Sugar is optional and you can skip it too. If you add cream, then you will need to add less sugar.",
            "Mix very well and simmer for a minute.",
            "After the gravy thickens to your desired consistency, then add the paneer cubes and stir gently. i keep the gravy to a medium consistency.",
            "After that add crushed kasuri methi (dry fenugreek leaves), garam masala and cream. Gently mix and then switch off the flame.",
            
            "Garnish it with coriander leaves and ginger julienne.",
            "You can even dot the gravy with some butter or drizzle some cream.",
            "Serve paneer butter masala hot with plain naan, garlic naan, roti, paratha or steamed basmati or jeera rice or even peas pulao.",
            "Side accompaniments can be an onion-cucumber salad or some pickle. Also serve some lemon wedges by the side.",
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "307kcal",
        "carbohydrates": "9g",
        "protein": "9g",
        "fat": "27g"
    },
    
    {
        "id": "6",
        "title": "Mix Veg",
        "description": "North Indian style mixed vegetable recipe is a family favorite, and I’m certain you’ll love it too! Use just one pot and any vegetables you might have on hand to make this delicious mix veg recipe. It tastes delicious with roti, paratha or poori.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "45 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "3 tablespoons oil – any neutral oil",
            "1 teaspoon cumin seeds",
            "½ cup finely chopped onions or 1 medium-sized onion",
            "1 teaspoon Ginger-Garlic Paste",
            "1 cup finely chopped tomatoes (tightly packed) or 2 medium to large tomatoes",
            "½ teaspoon turmeric powder (ground turmeric)",
            "½ teaspoon kashmiri chilli powder or paprika – add more for a spicy gravy",
            "2 teaspoons coriander powder (ground coriander)",
            "½ teaspoon Garam Masala Powder",
            "½ teaspoon chopped green chilies or 1 green chili",
            "⅓ to ½ cup chopped potatoes",
            "⅓ cup chopped capsicum",
            "⅓ cup chopped carrots",
            "¼ to ⅓ cup chopped french beans",
            "1 cup chopped cauliflower – blanch cauliflower if you prefer",
            "½ cup green peas – fresh or frozen",
            "1.5 cups water or add as required",
            "salt as required",
            "2 tablespoons cream (light or heavy) or malai or 3 tablespoons milk",
            "8 to 10 Paneer cubes – optional",
            "3 tablespoons chopped coriander leaves or 1 tablespoon chopped mint leaves"
        ],
        
        "procedure": [
            "In a kadai (wok), skillet or a thick bottomed pan, heat oil.",
            "Add cumin seeds and let them splutter.",
            "Then add finely chopped onions and sauté onions till they turn light golden.",
            
            "Then add the ginger-garlic paste. Sauté for about 10 to 12 seconds or until the raw aroma of both ginger and garlic goes away.",
            
            "Then add the tomatoes. Keep on stirring till the tomatoes become soft and pulpy.",
            "The process of sautéing the tomatoes takes a little longer. If you want to quicken the process, add a pinch of salt to the onion-tomato mixture. Sauté the tomatoes on a low heat as you don’t want the tomatoes to get burnt.",
            "If the ingredients starts sticking to the pan, add in some splashes of water. Mix and deglaze the pan. Continue to sauté further.",
            
            "When the mixture becomes smooth, pulpy, glossy and you see oil releasing from the sides, then add turmeric powder, kashmiri red chili powder, coriander powder and garam masala powder.",
            "Mix the ground spice powders very well with the onion-tomato mixture and sauté for a minute.",
            
            "Now add the chopped veggies, green peas and green chilies.",
            "Add water and salt as per taste. Mix again.",
            
            "Cover pan with a lid and let the veggies cook on a low to medium heat.",
            "Check periodically while the veggies are cooking.",
            
            "Once the veggies are half cooked, add the cream or malai or milk.",
            "Combine and mix well.",
            
            "Cover again with a lid and simmer the veggies till they are tender.",
            "Don’t forget to check the vegetables occasionally at intervals.",
            "Add more water if the water dries up and if the veggies are still to be cooked.",
            "Once the veggies are cooked and the mix veg curry is done, then switch off the heat and add 3 tablespoons chopped coriander leaves. Mix well. If using paneer, then add the paneer before you add the coriander leaves.",
            "You can also garnish veg curry with fried paneer cubes. Otherwise simply garnish with chopped coriander leaves or mint leaves.",
            "Serve mix veg curry hot or warm",
            
            "Enjoy the vegetable curry with roti, naan, paratha or poori. You can also serve it with steamed rice or cumin rice. The curry also pairs well with bread or dinner rolls.",
            "You can choose to garnish veg curry with fried paneer cubes. Otherwise simply garnish with chopped coriander or mint leaves.",
            
            "Store any leftovers in the refrigerator for 1 to 2 days. Reheat in a pan before serving. If the gravy has become thick, add a few splashes of water and mix well while reheating."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "247kcal",
        "carbohydrates": "26g",
        "protein": "6g",
        "fat": "15g"
    },
    
    {
        "id": "7",
        "title": "Matar Paneer",
        "description": "Matar paneer recipe – a popular Indian Curry dish made with green peas and Indian cottage cheese, is from the versatile Northern Indian cuisine that has many different (and delicious) variations. I’m sharing our family recipe of a flavorful and simple home-style mutter paneer.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "30 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "3 tablespoons oil or ghee",
            "½ teaspoon cumin seeds",
            "¼ teaspoon turmeric powder (ground turmeric)",
            "½ teaspoon kashmiri red chili powder or ¼ to ½ tsp red chilli powder or cayenne",
            "¼ teaspoon Garam Masala Powder or Punjabi garam masala powder",
            "1 tablespoon cream – light or heavy or can add malai, (optional)",
            "1 cup green peas (matar) – fresh or frozen, 130 grams",
            "1 to 1.25 cups water for stove-top pressure cooker and 1 cup water for Instant Pot",
            "salt as required",
            
            "½ teaspoon sugar or add as required – optional *check notes",
            "250 to 300 grams Paneer (Indian cottage cheese)",
            "½ teaspoon kasuri methi – crushed, (dry fenugreek leaves)",
            "1 to 2 tablespoons chopped coriander leaves (cilantro)",
            
            "¾ to 1 cup chopped tomatoes – 120 grams or 3 medium-sized",
            "½ cup chopped onions – 60 grams or 1 medium-sized",
            "1 teaspoon chopped green chilies or serrano peppers or 1 to 2 green chillies",
            "1 teaspoon chopped ginger or 1 inch ginger",
            
            "1 teaspoon chopped garlic or 3 to 4 medium-sized garlic cloves",
            "2 tablespoons chopped coriander leaves",
            "10 to 12 cashews",
            "4 to 5 black peppercorns",
            "2 cloves",
            "1 inch cinnamon (true) or ½ inch cassia cinnamon",
            "1 green cardamom – optional",
            "1 teaspoon coriander seeds"
        ],
        
        "procedure": [
            "In a grinder or blender take all the ingredients listed under masala paste – onions, tomatoes, ginger, garlic, green chilies, cashews, coriander leaves, black peppercorns, cinnamon, cardamom, coriander seeds and cloves.",
            "Grind all the ingredients to a smooth paste. If needed you can add 2 to 3 tablespoons of water while blending.",
            "There should be no small chunks or pieces of cashews in the paste.",
            "Set the ground paste aside.",
            
            "Heat oil in a 2-litre pressure cooker. Add the cumin seeds. Fry the cumin seeds until they splutter. (Read below on how to cook in a pan and Instant pot.)",
            "Then add the ground masala paste. Mix well. Take care while sautéing as the paste splutters. If there is too much spluttering, then cover partly with a lid until the spluttering stops.",
            "Saute for 10 to 12 minutes or more on a medium-low heat until the oil separates from the paste. The paste will also become thick and look glossy.",
            "Add all the ground spices – turmeric powder, red chili powder, garam masala powder. Mix well.",
            "If adding cream or malai, you can add now. Stir and saute for a minute.",
            "Then add the green peas or matar. Mix again.",
            "Add water and season with salt.",
            
            "Cover the cooker tightly and pressure cook for about 2 to 3 whistles or 9 to 10 minutes.",
            "When the pressure drops on its own, open the lid of the pressure cooker.",
            "If the curry appears thin, then simmer till it reaches the desired consistency. The consistency is medium and neither thick nor thin.",
            "If the gravy appears thick, then add some water and simmer for some minutes.",
            "Add the paneer cubes. Mix well or simmer for a few seconds until the paneer cubes are cooked. For a slight sweet taste, you can also add sugar just before you add the paneer cubes.",
            "Don't overcook after adding paneer, as they will becomes dense and hard.",
            "Garnish matar paneer with coriander leaves and serve hot or warm.",
            
            "Make the masala paste with tomatoes, spices, herbs and cashews as listed above.",
            "Press the sauté button of your Instant pot and let the display show “hot”. Add oil to the inner steel pot. Crackle the cumin seeds first.",
            "Add the ground masala paste and sauté stirring often until it thickens and looks glossy. You can press the sauté button twice to bring the setting to less, if in case the pot becomes too hot.",
            "Add the turmeric powder, red chilli powder and garam masala powder. Mix and sauté for a minute.",
            "Add the green peas, 1 cup of water, salt and combine thoroughly, deglazing if needed. Press the cancel button.",
            "Seal the lid and position the valve to sealing. Press the pressure cook/manual button and set the time to 3 minutes.","
            "Pressure cook on high pressure. After you hear the beep sound when the cooking is complete, wait for 5 minutes and then do a quick pressure release.",
            "Press the cancel button. Add paneer cubes and mix well. Finally add some coriander leaves and mix again. Serve hot or warm.",
            
            "First heat the oil in a heavy pan. Fry the cumin seeds.",
            "Add the masala paste and sauté stirring often until the oil releases from the sides.",
            "Add the ground spice powders and mix well.",
            "Add the green peas, salt and about 1.5 to 2 cups water. Mix again.",
            "Close the pan and cook the green peas until they soften. If the curry becomes too thick or dries up while cooking, add some more water.",
            "When the peas are cooked, add the paneer. Mix and switch off heat. To add more flavors, at this step together with the paneer, you can add crushed kasuri methi.",
            "Garnish with coriander leaves and serve.",
            
            "Matar paneer goes well with Indian flatbreads like roti, paratha, naan. It also tastes nice with cumin rice and steamed basmati rice.",
            "You can also eat it with puri (Indian fried bread). A side vegetable salad or raita pairs really well with the combination of matar paneer and paratha.",
            
            "If you have any leftovers refrigerate in an airtight container for 1 to 2 days. The curry will thicken after cooling and so while reheating, add a bit of water to loosen the consistency."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "349kcal",
        "carbohydrates": "13g",
        "protein": "12g",
        "fat": "28g"
    },
    
    {
        "id": "8",
        "title": "Palak Corn",
        "description": "Palak corn curry is a rich, saucy dish that's made with fresh spinach and sweet corn. It is lightly spiced and perfectly creamy, and great to pair with classic Indian sides.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Main Course",
        "time": "30 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 bunch spinach (palak) – yields approx 2 to 2.5 cups spinach puree or 250 grams spinach",
            "4 to 5 cups water – for boiling the water and blanching the spinach",
            "2 to 3 cups ice cold water or chilled water – for adding the blanched spinach leaves",
            "2 cups sweet corn kernels or 2 medium corn cobs or green peas",
            "1 teaspoon cumin seeds",
            "1 pinch turmeric powder (ground turmeric)",
            "¼ teaspoon red chili powder or cayenne pepper",
            "1 pinch asafoetida (hing) – optional",
            "¼ or ½ teaspoon Garam Masala Powder",
            "½ teaspoon dry fenugreek leaves (kasuri methi), crushed",
            "¼ cup light cream or cooking cream (20% to 25% low fat cream) – whisked till smooth – optional",
            "1 cup water",
            "2 to 3 tablespoons oil or butter or ghee",

            "⅓ cup chopped onion or 1 medium-sized",
            "½ cup chopped tomatoes or 1 medium-sized",
            "1 inch ginger – roughly chopped",
            "3 to 4 garlic cloves – small to medium sized, chopped",
            "1 or 2 green chilies – chopped or 1 teaspoon chopped",
            "2 tablespoons chopped cashews",
            "½ tablespoon melon seeds (magaz) – you can also use watermelon seeds.",

            "½ to 1 inch ginger – julienne"
        ],
        
        "procedure": [
            "In a small grinder or blender, add all the ingredients listed under Masala paste above.",
            "Grind or blend to a smooth paste. Add very little water if required while grinding.",
            "Keep this masala paste aside.",

            "Rinse the spinach very well in water. Boil water with ½ teaspoon salt. Let the water comes to a boil. Then switch off the flame. Immediately add the spinach leaves to this hot water.",
            "And let the spinach leaves be immersed in the water for 2 to 3 minutes.",
            "Drain the water and quickly pour ice water over the spinach or immerse the spinach in ice cold or cold water. Keep for 2 to 3 minutes.",
            "Drain the ice cold water or remove the blanched spinach leaves with the help of pasta tongs and place them in a blender.",
            "Blend to a semi-fine or smooth spinach puree adding very little water, if needed. Set aside.",

            "First steam or boil the corn kernels and keep aside. You can choose to steam the raw corn kernels or corn cobs in a pan or steamer or stovetop pressure cooker or Instant Pot.",
            "In the step wise instructions above I have detailed the steps to cook corn kernels in a stovetop pressure cooker. You can also use canned corn kernels to cut down on cooking time.",
            "After you have cooked the corn kernels drain all the water from them and set aside.",
            "For the cooked corn cobs, let them cool completely. Then carefully remove the corn kernels with a knife.",
            "Heat oil or butter or ghee in a thick bottomed pan. Fry the cumin first till they crackle, become aromatic and are browned.",
            "Now add the ground masala paste and mix very well.",
            "Then add the turmeric powder, red chili powder, asafoetida and garam masala powder.",
            "Keep on stirring and sautéing the masala, till the oil starts to leave the sides of the paste.",
            "When you see that the oil has started leaving the sides of the masala paste and its color has changed, the paste has thickened and have become glossy, then add the spinach puree. Mix very well.",
            "Then pour water and season with salt as required. Simmer the curry for 6 to 7 minutes on a low heat. Later add the boiled corn kernels and simmer for 1 to 2 minutes more.",
            "Whip or beat cream till smooth in a bowl with a wired whisk or spoon.",
            "Now add cream and dry fenugreek leaves. Stir and cook further for ½ to 1 minute.",
            "Garnish with ginger julienne and serve corn palak hot with naan, roti, paratha or jeera rice or steamed rice."
        ],
        
        "healthPreference": "",
        "calories": "241kcal",
        "carbohydrates": "27g",
        "protein": "7g",
        "fat": "14g"
    },
    
    {
        "id": "9",
        "title": "Paneer Bhurji",
        "description": "Paneer Bhurji is a medley of onions, tomatoes, spices with scrambled cottage cheese. It is a popular North Indian breakfast recipe. This Paneer Bhurji Recipe is Punjabi Style and way it is made in my home.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "20 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "3 tablespoons oil or ghee, butter or white butter",
            "½ teaspoon cumin seeds",
            "½ cup finely chopped onions or 1 medium sized onion",
            "3 to 4 small garlic cloves + 1 inch ginger made to a paste in mortar-pestle or 1 teaspoon ginger-garlic paste",
            "1 or 2 green chillies – finely chopped or slit",
            "1 cup finely chopped tomatoes (tightly packed) or 2 medium sized to large tomatoes",
            "¼ teaspoon turmeric powder (ground turmeric)",
            "½ teaspoon red chilli powder or ¼ to ½ teaspoon cayenne pepper",
            "½ teaspoon coriander powder",
            "¼ to ½ teaspoon Garam Masala Powder",
            "200 to 250 grams Paneer (cottage cheese)",
            "salt as required",
            "3 tablespoons chopped coriander leaves (cilantro)"
        ],
        
        "procedure": [
            "Crumble the paneer (cottage cheese) and keep aside",
            "Finely Chop the onions, tomatoes and green chillies. Keep aside.",
            "Crush the ginger and garlic to a paste in a mortar pestle and keep aside.",
            "Also remove the spice powders and keep aside.",

            "Heat oil or ghee or butter in a pan. Let the oil become hot on a medium-low or medium flame.",
            "Add cumin seeds. Let them crackle and change color. Once they get browned, add onions.",
            "Mix well and sauté the onions. When the onions become translucent, add ginger-garlic paste and chopped green chilies.",
            "Sauté for some seconds till the raw aroma of the ginger-garlic goes away.",
            "Then add tomatoes and sauté on medium-low heat till they become soft. You can add a pinch of salt so that the tomatoes get cooked faster.",
            "Now add all the dry spice powders – turmeric, red chili powder, coriander powder and garam masala powder.",
            "Mix the spice powders very well and sauté for 5 to 6 seconds.",
            "Then, add the crumbled paneer. Mix throughly and cook for 1 minute.",
            "Don’t cook the paneer for a long time as they harden and loose their softness.",
            "Lastly add the chopped coriander leaves and mix.",
            "Serve Paneer Bhurji hot with bread toast. You can also serve it with roti, plain paratha or as a stuffing in burrito or wraps."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "353kcal",
        "carbohydrates": "9g",
        "protein": "10g",
        "fat": "31g"
    },
    
    {
        "id": "10",
        "title": "Lassi",
        "description": "Lassi is a cooling, refreshing, probiotic drink perfect for the warm summer months. Popular in Punjab and North India, there are many variations of this sweet lassi recipe. Find three easy, energizing and flavorful lassi recipe variations.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Beverages",
        "time": "10 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "2 cups Curd – cold and fresh (yogurt)",
            "1 cup water or milk – cold or at room temperature",
            "4 to 5 tablespoons sugar or add as per taste",
            "1 teaspoon cardamom powder or 8 to 10 green cardamoms or 1 tablespoon rose water",
            "10 to 12 saffron strands – optional",
            "6 to 8 ice cubes – optional",
            "1 to 2 tablespoons chopped nuts – cashews, almonds, pistachios, optional",

            "2.5 cups Curd – cold and fresh (yogurt)",
            "1 cup water – cold or at room temperature",
            "1 teaspoon black salt or regular salt or edible rock salt, as required",
            "1.5 teaspoons roasted cumin powder",
            "6 to 7 mint leaves",

            "2 cups Curd – cold and fresh (yogurt)",
            "3 to 4 green cardamoms – seeds crushed in mortar and husks removed",
            "¼ teaspoon crushed black pepper",
            "1 to 2 pinches grated nutmeg or ground nutmeg",
            "2 tablespoons chopped almonds or cashews or pistachios",
            "10 to 12 saffron strands – optional",
            "5 to 6 tablespoons chopped palm sugar (palm jaggery) or jaggery or sugar",
            "⅓ to ½ cup water – cold or at room temperature, add as required"
        ],
        
        "procedure": [
            "In a mortar, take the green cardamom pods and crush them lightly. Remove the husks and crush the seeds to a fine powder.",
            "In a bowl or pan, take fresh chilled curd (yogurt).",
            "With the handheld wooden churner (madani)or blender or wired whisk, simply whisk the curd until it becomes smooth.",
            "Add sugar and cold water. You can also add cold milk instead of water.",
            "The consistency of this lassi is neither thick nor thin. For a thin lassi, add slightly more water and for a thicker version, add less water.",
            "Now churn or beat again with the churner, blender or wired whisk.",
            "Keep on churning or whisking until the sugar dissolves and you see a nice frothy layer on top. You can use an immersion blender for the same. Another way is to add all the ingredients in a blender jar and blend until smooth and frothy.",
            "Now add the crushed cardamom powder and saffron strands. Mix well. Do check the taste and add more sugar if required.",

            "As a substitute for cardamom powder, add rose water. You can skip all the flavoring ingredients, if you don't have any.",
            "Pour lassi in tall glasses and serve. Add a few ice cubes if you prefer. If you want, you can top lassi in each glass with 1 to 2 tablespoons of malai (the thick layer of cream which collects on top of heated milk) or 1 to 2 tablespoons of unsalted white butter (makhan).",
            "Garnish with a pinch or two of cardamom powder, 2 to 3 crushed saffron strands or chopped nuts like cashews, pistachios or almonds. Serve sweet punjabi lassi straightaway.",

            "Take the curd and water in a bowl or pan. Season with salt and roasted cumin powder.",
            "To make your own roasted ground cumin, dry roast cumin seeds in a small skillet or frying pan until fragrant. Then crush in a mortar-pestle or grind finely in a spice-grinder.",
            "With a wired whisk blend everything well till smooth. A blender or an immersion blender also works.",
            "Pour the salted lassi in glasses. Garnish with mint leaves. You can add a few ice cubes if you like. If you wish to avoid the ice cubes, then make lassi with chilled yogurt and cold water.",

            "In a blender take the curd, crushed seeds of the green cardamons, crushed black pepper, grated nutmeg, chopped almonds or cashews or pistachios or a mix of all three nuts.",
            "Add the saffron strands and chopped palm jaggery (palm sugar) or jaggery or sugar. Add water.",
            "Blend until smooth and frothy. Check the taste and add more palm sugar if needed and blend again. Serve straightaway topped with a few saffron strands or chopped nuts."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "374kcal",
        "carbohydrates": "61g",
        "protein": "10g",
        "fat": "11g"
    },
    
    {
        "id": "11",
        "title": "Mooli Paratha",
        "description": "Mooli paratha is a popular Punjabi whole wheat flatbread made with unleavened dough and filled with spiced grated radish stuffing. They are often made for breakfast or lunch and make for a filling and tasty meal accompanies with pickle, curd (yogurt) or white butter.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "1 hour",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "2 cups whole wheat flour",
            "1 to 2 teaspoons oil or ghee (clarified butter)",
            "¼ to ½ teaspoon salt or add as required",
            "water as required to knead",

            "1 radish white, (mooli, daikon) – medium to large with or without leaves",
            "1 or 2 green chilies finely chopped",
            "red chilli powder as required – or cayenne pepper or paprika",
            "salt as needed",

            "Garam Masala Powder – optional",
            "Ghee (clarified butter) or oil for roasting",
            "White Butter to serve with the paratha",
        ],
        
        "procedure": [
            "Knead whole wheat dough with the flour, salt, oil adding water as needed until soft and pliable. Set it aside.",
            "Grate the mooli (white radish) and set aside for 15 to 20 minutes and later squeeze the water from it.",
            "This is done so that the mooli paratha do not break while rolling the dough. This radish juice can be used to make the dough instead of water.",
            "Add chopped green chilies to the grated mooli.",

            "Now take two lemon sized ball from the dough and roll them into a small circle, about 5 to 6 cms on the rolling board dusted with wheat flour.",
            "Take a good amount of the mooli stuffing and place it on one of the rolled dough.",
            "Don’t use too much stuffing as in that case the mooli parathas can break while rolling.",
            "Sprinkle evenly one or two pinch of salt, red chilli powder and garam masala powder. Cover with the other rolled round and join the edges.",
            "In the meantime, heat the griddle or tava. Roll the dough into the size of a paratha or roti.",
            "Care should be taken while rolling the dough as the paratha may break.",
            "We have added salt to the mooli and thus as a result some juice will start oozing out from the mooli paratha. Its ok.",

            "Heat a tawa (skillet) and place the paratha on the tawa. The tawa should be medium hot. Also keep the flame to medium-high to high. Don't roast the paratha on a low flame. Roasting paratha on a low flame can make them hard or dense and you won't get a good taste.",

            "Roast the paratha on a hot tava or griddle using ghee and oil. Keep the heat to medium-high to high.",
            "Use a liberal amount of ghee or oil to fry the paratha. A well-fried paratha will have some brown spots and might puff up little.",
            "Make sure that the paratha edges are fried well. You can use spatula to press them.",
            "You can flip the paratha a couple of times till you see brown spots and the paratha is cooked evenly. The paratha should become golden and crisp from both sides. Make all parathas this way.",
            "Serve Punjabi Mooli Paratha hot with butter or curd or the pickle of your choice. You can also pack them in a lunch box. I love to have these paratha with plain curd or as an evening snack with a cup of hot tea."
        ],
        
        "healthPreference": "",
        "calories": "515kcal",
        "carbohydrates": "61g",
        "protein": "11g",
        "fat": "28g"
    },
    
    {
        "id": "12",
        "title": "Dhaba Style Aloo Paratha",
        "description": "Dhaba style aloo paratha recipe - whole wheat flat breads stuffed with a spicy, tangy potato stuffing flavored with green chilies, dry pomegranate seeds and carom seeds.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "1 hour",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 extra large potato or 2 medium potatoes (aloo)",
            "1 green chili, finely chopped (hari mirch)",
            "1 to 2 tablespoons chopped coriander leaves",
            "½ teaspoon ajwain (carom seeds)",
            "¼ teaspoon Punjabi Garam Masala Powder or regular garam masala powder",
            "¼ teaspoon red chili powder or ½ teaspoon kashmiri red chili powder or deghi mirch",
            "1 teaspoon dry pomegranate seeds (anardana)",
            "½ teaspoon chaat masala powder (optional)",
            "salt as required",

            "2 cups whole wheat flour (atta)",
            "¼ teaspoon salt",
            "½ teaspoon oil (optional)",
            "water as required",
            
            "oil or ghee as required"
        ],
        
        "procedure": [
            "First mix the flour with salt and oil.",
            "Add water and knead to a smooth and soft dough.",
            "Cover and let the dough rest for 15-20 minutes.",
            "Boil the aloo or potato in a pressure cooker",
            "When slightly hot or warm, peel and mash the aloo with a fork or masher.",
            "Lightly, roast the pomegranate seeds on a tava or small pan.",
            "Take these lightly roasted pomegranate seeds in a mortar-pestle and crush them to semi fine powder.",
            "Add the pomegranate or anardana powder, garam masala, red chili powder, chaat masala, green chilies, coriander leaves and salt to the mashed potatoes.",
            "Mix uniformly.",
            "Taste the aloo stuffing and add more of the spices or salt if required.",
            
            "Take two small or medium balls from the dough.",
            "On a dusted floor, roll the balls into small circles.",
            "Place a few tbsps of the filling on one of the dough circle.",
            "Keep in mind that the filling should not be too less or too much.",
            "Sprinkle some flour on the filling. This helps in absorbing the moisture and when rolling, the paratha does not break or tear.",
            "Lightly sprinkle some wheat flour and roll the aloo paratha gently into a diameter of 6-8 inches.",

            "Place the stuffed aloo paratha on a hot tava or griddle.",
            "When one side has slightly browned, flip the paratha.",
            "Spread or brush some oil on the browned side.",
            "Flip again and brush oil on the other side.",
            "Flip once or twice, till you see golden spots on the aloo paratha and they look crisp and well cooked.",
            "Serve the aloo paratha hot with yogurt, mango pickle or lemon pickle topped with some butter."
        ],
        
        "healthPreference": "",
        "calories": "515kcal",
        "carbohydrates": "61g",
        "protein": "11g",
        "fat": "28g"
    },
    
    {
        "id": "13",
        "title": "Gobi Paratha",
        "description": "Cauliflower paratha is unleavened whole wheat flatbread stuffed with a spiced grated cauliflower filling. Gobi paratha is often made for breakfast in Punjabi homes as well as served in restaurants and Punjabi dhabas.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "50 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "3 cups whole wheat flour – 360 grams",
            "1 cup water or add more if required",
            "1 teaspoon salt or as required – optional",
            "1 tablespoon Ghee or oil, add as required – optional",
            
            "½ cauliflower head – finely grated",
            "1 green chili – chopped finely or 1 teaspoon finely chopped",
            "1 teaspoon Garam Masala Powder or as required",
            "1 teaspoon red chili powder or as required",
            "salt as required",

            "Ghee (clarified butter) or oil as required"
        ],
        
        "procedure": [
            "In a bowl take the whole wheat flour along with salt as required. Add 1 tablespoon ghee or oil.",
            "Next add 1 cup water or as required. Knead the wheat flour with water to a smooth and soft dough.",
            "Cover and keep aside for 20 to 30 minutes.",

            "Rinse the cauliflower head very well.",
            "Then grate cauliflower with a fine grater all the way through until you come to the stalks. Do not grate the stalks.",
            "Add some finely chopped green chilies to it.",
            "Uniformly mix the green chilies with the grated cauliflower. Set aside.",

            "Later take 2 small to medium sized balls from the dough. Dust them with some flour on the rolling board.",

            "With a rolling pin (belan), roll both the dough balls to a size of about 3 to 4 inches in diameter.",
            "Now spread some ghee over one of the rolled disc. Top it with a few tablespoons of the grated cauliflower mix and keep about 1 inch empty space from the sides.",
            "Sprinkle 1 to 2 pinches of salt, red chili powder and garam masala powder all over evenly on the grated cauliflower filling.",
            "Also sprinkle some wheat flour. As the grated cauliflower tend to be moist, sprinkling little wheat flour helps the parathas not to be moist and sticky when rolling with a rolling pin (belan).",
            "Be careful as not to under-stuff or overstuff the paratha. Cover with the other rolled dough or disc.",
            "Press and seal the edges very well with your fingertips.",
            "Dust some flour on the stuffed paratha and start rolling the gobi paratha with the help of a rolling pin (belan). Roll very gently and lightly till you get the paratha to a size of a chapati or roti, about 6 to 8 inches.",

            "On a hot tava (tawa or skillet or griddle) place the rolled gobi paratha.",
            "Roast the gobhi paratha with ghee till browned and uniformly roasted on both sides on a medium-high to high heat.",
            "You can also press the gobhi paratha edges with a spatula or spoon, so that they are fried well. As some time, the paratha edges are not cooked well.",
            "Make all gobhi paratha this way and stack them up in a roti basket or casserole.",
            "Serve gobi paratha hot or warm with yogurt, pickle or white butter."
        ],
        
        "healthPreference": "",
        "calories": "157kcal",
        "carbohydrates": "23g",
        "protein": "4g",
        "fat": "6g"
    },
    
    {
        "id": "14",
        "title": "Onion Paratha",
        "description": "Onion Paratha are delicious whole wheat flatbreads stuffed with flavorful onions, spicy green chillies and savory spices. Also known as pyaz paratha, this tasty paratha variant is made in many Punjabi homes for breakfast. Make this delish paratha with my family recipe!",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "50 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "2 cups whole wheat flour",
            "½ teaspoon salt",
            "1 to 2 teaspoons oil or ghee, (optional)",
            "⅓ to ½ cup water or as required",
            
            "1 large onion – finely chopped",
            "1 to 2 green chillies – finely chopped or minced (optional)",
            "Garam Masala Powder – as required",
            "red chili powder or cayenne pepper or paprika, as required",
            "salt as required",
            "oil or ghee (clarified butter), as required for roasting"
        ],
        
        "procedure": [
            "Mix the flour with the salt. Add the oil or ghee and a bit of water.",
            "Begin to knead the dough adding water as needed. Knead to a smooth and soft dough.",
            "Cover and keep aside the dough for 20 to 30 minutes.",

            "As the dough is resting we prepare the filling.",
            "Finely chop the onions & green chilies. If the onions and green chillies are not finely chopped then they will pop out of the paratha while rolling or roasting. So do remember to finely chop them.",
            "Mix them together and set aside.",

            "Make medium sized balls from the dough.",
            "Take a ball and roll into 3 to 4 inch diameter disc on a dusted board.",

            "Add the finely chopped onions-chilies mixture in the center.",
            "Sprinkle one or two pinch of garam masala powder, red chili powder and salt.",
            "Bring together all the edges of the dough.",
            "Join them in the center and press downwards.",
            "Sprinkle some more flour and roll into a paratha of about 6 to 8 inches in diameter.",
            "Heat a tawa or griddle or skillet before you start rolling the paratha. Keep the flame to medium-high or high. Once the tawa becomes hot then place the rolled onion paratha on it.",
            "Fry the paratha on a hot tava drizzling about 1 or 2 teaspoons of ghee or oil (or,as required) on both sides till the paratha is evenly cooked and browned. Make sure that the paratha edges are also cooked well. You can press the edges with, a spatula for even cooking.",
            "Serve onion paratha hot with some mango pickle, yogurt (dairy or vegan) or a side vegetable dish.",
            "These parathas taste so good that they can be had as is with Indian chai. They can also be packed in a tiffin box."
        ],
        
        "healthPreference": "",
        "calories": "158kcal",
        "carbohydrates": "21g",
        "protein": "4g",
        "fat": "7g"
    },
    
    {
        "id": "15",
        "title": "Paneer Paratha",
        "description": "Paneer paratha is a popular North Indian flatbread made with whole wheat flour dough and stuffed with savory, spiced, grated paneer (Indian cottage cheese) stuffing. Paneer paratha is one of the most popular stuffed paratha varieties from Punjab and usually made for breakfast.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "45 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "2 to 2.25 cups whole wheat flour – 240 grams to 270 grams",
            "⅔ cup water or add as required",
            "1 teaspoon Ghee or oil",
            "½ teaspoon salt or add as required",
            
            "200 grams Paneer (Indian cottage cheese)",
            "1 or 2 green chilies – finely chopped or ½ to 1 teaspoon",
            "½ teaspoon red chili powder",
            "½ teaspoon Garam Masala Powder",
            "½ to ¾ teaspoon dry mango powder (amchur powder) or add as per your taste",
            "½ teaspoon salt or add as required",
            "Ghee or oil as required for roasting parathas"
        ],
        
        "procedure": [
            "Take whole wheat flour, salt, ghee or oil in a mixing bowl.",
            "Pour ½ cup water first.",
            "Mix and begin to knead. Add more water if required and knead to a smooth soft dough. Overall I added ⅔ cup water.",
            "Cover and allow the dough to rest for 20 to 30 minutes.",

            "Meanwhile while the dough is resting, prepare the stuffing. Grate the paneer.",
            "Add the finely chopped green chilies, dry mango powder, punjabi garam masala or garam masala powder, red chili powder and salt.",
            "You can add more of the salt, red chili powder or dry mango powder if you prefer.",
            "Mix everything well so that the spice powders are evenly mixed with the grated paneer.",

            "Pinch two small balls from the dough and roll them in your palms to make them even.",
            "Dust some flour on the dough balls.",
            "With a rolling pin, roll the dough balls to a circle of about 4 to 5 inches in diameter.",
            "Place the paneer stuffing on one of the rolled rounds keeping one inch space around the circumference.",
            "Cover with the other rolled dough and press the edges well.",
            "Sprinkle some flour and roll the stuffed paratha to a circle of about 6 to 7 inches in diameter.",
            
            "Heat a tava or griddle and then place the rolled paratha on it. The tava should be hot. To check the heat, sprinkle a generous pinch of whole wheat flour on the tawa. If the whole wheat flour becomes brown in some seconds, the tawa is hot enough to roast the parathas.",
            "Flip when one side is partly cooked. About ¼ cooked.",

            "Apply ghee on this side with a spoon. Turn over and flip when the second side is half cooked.",
            "Let the ghee side get cooked now. Spread some ghee on the top. Flip again using a spatula.",
            "Press the paratha edges with a spatula so that the edges are cooked.",
            "Flip once or twice till the paratha has golden spots and is evenly cooked.",
            "Place them in a roti basket or casserole.",
            "Optionally you can place some butter on top and spread it with a spoon.¼",
            "Wipe the excess whole wheat flour if any, with a cotton kitchen napkin. So that the browned whole wheat flour does not stick to the parathas.",
            "Make all paratha this way on the tawa (griddle).",
            "Keep on stacking them in the roti basket or casserole. Spread some butter on each paratha while stacking them.",
            "If not stacking them, then serve paneer paratha hot with some fresh yogurt or pickle and butter. A cup of hot ginger tea will also go very well."
        ],
        
        "healthPreference": "",
        "calories": "224kcal",
        "carbohydrates": "21g",
        "protein": "7g",
        "fat": "13g"
    },
    
    {
        "id": "16",
        "title": "Lachha Paratha",
        "description": "Lachha Paratha are crispy flaky layered whole wheat flatbreads made with a simple unleavened dough consisting of whole wheat flour, salt and ghee or oil. They are a popular variant of paratha from the North Indian cuisine.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Punjabi",
        "course": "Breakfast",
        "time": "1 hour",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "2 cups whole wheat flour",
            "1 to 2 teaspoon Ghee (clarified butter) or oil",
            "salt as required",
            "water as required for kneading",
            "ghee or oil as required for applying on the dough as well as roasting"
        ],
        
        "procedure": [
            "In a bowl or vessel take 2 cups whole wheat flour along with salt as per taste.",
            "Add 1 to 2 teaspoons of ghee or oil. Next add water as required in parts.",

            "Knead the whole wheat flour with water to a smooth dough. Cover the bowl with a lid and keep aside to rest for 20 to 30 minutes.",
            "Later make medium sized balls from the dough. Cover the bowl or the pan with a napkin or lid.",

            "Take a dough ball. Roll it into 8 to 8.5 inches diameter thin disc on a dusted rolling board.",
            "Apply ghee or oil liberally on the paratha disc. Sprinkle some flour on the top.",
            "From the edges start to fold and pleat the paratha till the end.",
            "Roll the pleated edges tightly. Join the edges.",
            "Lightly dust with flour and now roll into round parathas of about 7 inches in diameter.",

            "Heat the tava or griddle or frying pan. The tava should be hot. Place the paratha on the tava. Keep the flame to medium-high or high.",

            "Turn the paratha when one side is partly cooked. Apply ghee on this side. Cook for a minute.",
            "Now turn again and apply ghee on the other side.",
            "Flip again for a couple of times, till the parathas are browned evenly and well cooked. Press the sides with the spatula while frying the parathas. As sometimes the edges are not cooked well. So I always press the edges of paratha with a spatula.",
            "Alternatively, you could also add some ghee on the tava and then pan fry the paratha.",
            "Serve the lachha paratha hot with any Indian dal or a vegetable curry of your choice.",
            "Some recipes that will taste very good with these parathas are dal makhani, chana masala, rajma masala, palak paneer, veg kurma, veg kadai, matar paneer, aloo matar etc.",
            "For best taste have these parathas hot. They can also be had with a cup of hot tea or can be had with mango pickle or lemon pickle."
        ],
        
        "healthPreference": "",
        "calories": "239kcal",
        "carbohydrates": "22g",
        "protein": "4g",
        "fat": "16g"
    },
    
    {
        "id": "17",
        "title": "Kashmiri Pulao",
        "description": "My recipe for Kashmiri Pulao is packed with toasted nuts and warming spices for an aromatic rice dish that is mild and faintly sweet in taste. Whether you serve this gluten-free and vegetarian dish as a side or light lunch, you’re sure to love it.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Kashmiri",
        "course": "Main Course",
        "time": "45 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 cup basmati rice soaked in water for 20 to 30 minutes",
            "1 inch cinnamon",
            "1 teaspoon caraway seeds (shahi jeera)",
            "1 tej patta (Indian bay leaf)",
            "3 cloves",
            "2 to 3 green cardamoms",
            "1 to 2 black cardamoms",
            "½ teaspoon dry ginger powder (ground ginger)",
            "1 teaspoon fennel powder (ground fennel)",
            "2 pinches saffron strands",
            "2 to 3 tablespoons Ghee or any neutral tasting oil",
            "2 to 2.25 cups water or as required",
            "salt as required",

            "½ cup thinly sliced onions or 1 medium-sized",
            "10 to 12 cashews",
            "10 to 12 almonds",
            "10 to 12 walnuts",
            "2 tablespoons Ghee or any neutral tasting oil"
        ],
        
        "procedure": [
            "Rinse basmati rice a few times in water until the water is clear of starch. Soak the rice in enough water in a bowl for 20 to 30 minutes. Later drain all the water and set the soaked rice aside.",
            "On a low or medium heat, heat oil or ghee in a deep pan or pot.",
            "Add cinnamon stick, caraway seeds, tej patta, cloves, green cardamoms and black cardamoms.",
            "Fry the spices for some seconds until they crackle and the oil becomes fragrant.",
            "Now lower the heat or switch the heat off. Add the dry ginger powder and fennel powder. Mix and stir well taking care that you do not burn these ground spices.",
            "Add the soaked basmati rice. Mix gently and sauté for a minute.",
            "Add whole or crushed saffron strands. Mix and sauté.",
            "Pour water and add salt as required. Stir and mix again. Check the taste of the water and it should taste a bit salty. Cover the pan tightly and simmer on medium-low heat until the rice grains are tender. When the rice is cooking, prepare the garnish.",

            "Heat 2 tablespoons ghee or oil in a frying pan. Add the sliced onions.",
            "Also add a pinch of salt and sauté the onions till they are golden or caramelized and crisp. Remove with a slotted spoon and place on kitchen paper tissues. Stir often when sautéing the onions.",
            "Some ghee or oil will be left in the pan. To the same ghee or oil, add the almonds. Fry them until they become crisp and crunchy. Remove and place fried almonds on kitchen paper tissues",
            "Now fry the cashews till they are crisp and lightly browned. Place them on kitchen paper tissues",
            "Also fry the walnuts till they are crisp and lightly browned. Remove fried walnuts. Place on kitchen paper tissues",
            "Cook the rice until softened, fluffy, tender and all the water has been absorbed. When done, fluff the rice with a fork.",
            "While serving top Kashmiri pulao with the caramelized onions and the fried nuts garnish. You can also garnish with fresh fruits cubes of apple, pineapple or pomegranate arils.",
            "Kashmiri pulao can be enjoyed as is or with a side of any raita or paneer curry or vegetable curry. You can also serve it with dal-tadka."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "493kcal",
        "carbohydrates": "59g",
        "protein": "8g",
        "fat": "26g"
    },
    
    {
        "id": "18",
        "title": "Kashmiri Dum Aloo",
        "description": "Dum Aloo is a delicious recipe of baby potatoes cooked in a gravy or sauce. This dish is made in various ways in Indian Cuisine. Baby potatoes simmered (dum cooked) in a spicy yogurt sauce or gravy. An authentic recipe from the Kashmiri cuisine.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Kashmiri",
        "course": "Main Course",
        "time": "50 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "500 grams potatoes or 20 to 22 baby potatoes",
            "3 to 3.5 cups water",
            "¼ teaspoon salt",

            "3 teaspoon kashmiri red chili powder (or deghi mirch), mixed in 2 tablespoon water",
            "½ tablespoon ginger powder",
            "1 tablespoon fennel powder",
            "1 teaspoon caraway seeds (shah jeera)",
            "1 inch cinnamon",

            "3 cloves",
            "1 black cardamom",
            "4 to 5 black peppers",
            "1 green cardamom - optional",
            "6 tablespoon fresh full fat curd, beaten or whisked till smooth (yogurt)",
            "1.5 cups water",
            "¾ cup mustard oil for frying potatoes",
            "2 tablespoon fresh mustard oil for making gravy or reserve 2 tablespoon mustard oil from the ¾ cup that is used for frying potatoes.",
            "salt as required",
            "some caraway seeds as garnishing - optional"
        ],
        
        "procedure": [
            "Rinse the baby potatoes well. Brush or scrub the mud etc from them. Take 3.5 cups water in a pan. Add the potatoes.",
            "On a medium to high flame boil the water, so that the potatoes are half cooked.",
            "Drain them and allow to become warm or cool down at room temperature.",
            "Peel the potatoes. This task takes a lot of time, so do it while listening to music or watching your favorite tv show. If you want you can keep the peels too.",
            "With a fork, tooth pick or skewer, poke holes in the potatoes all over. Halve them or you can keep them whole if they are small. This is done so that when cooking on dum, the potatoes absorb the flavors of the masala in which they are getting cooked.",

            "Whisk the fresh full fat curd or yogurt till smooth. Keep aside.",
            "In a small bowl, take kashmiri red chili powder and water.",
            "Mix and stir well to get a smooth mixture.",

            "In a pan heat mustard oil till it begins to smoke.",
            "Add the parboiled peeled potatoes and begin to fry them on a low to medium flame.",
            "With a slotted spoon, turn them over while frying, when one side is light golden.",
            "Remove the potatoes which are golden and crisp with a slotted spoon. Fry them well or else they remain uncooked from the center.",
            "Place them on kitchen paper towels. Fry all the potatoes till golden and crisp.",
            "If you want you can again poke holes in the fried potatoes. This is an optional step.",

            "Lower the flame. Remove the extra oil and keep 2 tbsp oil in the same pan. Let the oil temperature come down. In the same oil, add asafoetida powder. Stir well.",
            "Then add the red chili + water solution and stir well. Be careful as the mixture splutters.",
            "Now add the beaten curd. When you are adding the curd, with a spoon or wired whisk, stir continuously, so that the curd does not split. Add the curd on a low flame.",
            "After adding curd, add water and continue to stir.",
            "Stir and mix very well.",
            "Then add fennel powder. If you do not have ready fennel powder than you have to make it. Roast the fennel lightly on a pan or tava. When cooled, then in a mortar & pestle pound the roasted fennel seed to a medium fine powder. You can also grind in a small spice grinder or coffee grinder.",
            "Add the whole spices and ginger powder. Stir well.",
            "Now add the potatoes. Again stir.",
            "Season with salt and stir again.",
            "Cover the pan tightly with a lid. Cook for 8 to 10 minutes on a low to medium flame. Here we are cooking the potato gravy on dum.",
            "The gravy should become thick.",
            "You can always add less or more water depending on how thick or thin you want the gravy. If you cook more, then the gravy will reduce more. So depending on what you prefer, you can cook for less or more time.",
            "Sprinkle some caraway seeds from top (optional) and serve kashmiri dum aloo hot with naan, rotis or rice"
        ],
        
        "healthPreference": "",
        "calories": "470kcal",
        "carbohydrates": "41g",
        "protein": "10g",
        "fat": "31g"
    },
    
    {
        "id": "19",
        "title": "Kashmiri Kahwa",
        "description": "Kahwa is a fragrant, mild green tea made with whole spices, saffron, almonds and originally from the Kashmiri cuisine. Kahwa is a warming tea and always had hot. Using whole spices and saffron makes Kashmiri Kahwa warming for the body which suits the cold climate of kashmir.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Kashmiri",
        "course": "Beverages",
        "time": "10 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "2 cups water",
            "2 inches cinnamon (dalchini) – use true cinnamon and not cassia cinnamon",
            "2 green cardamoms (choti elaichi)",
            "2 cloves (lavang)",
            "5 to 6 dried rose petals – optional",
            "2 tablespoons sugar or add as per taste",
            "1 teaspoon green tea leaves or add as required",
            "4 to 5 almonds (sliced or crushed or chopped) – optional",
            "10 to 12 saffron strands – optional"
        ],
        
        "procedure": [
            "Get all the spices ready before you start making kahwa.",
            "Take the cinnamon, cloves and green cardamoms in a mortar-pestle. Crush them lightly.",
            "Slice almonds thinly. Almonds can be crushed also in the mortar-pestle. You can even use 2 to 3 walnuts in place of almonds – chop them and add.",

            "In a saucepan, take the water. Place saucepan on the stove-top on a medium flame.",
            "Add the lightly crushed spices and dried rose petals in the water.",
            "Add sugar or add as per taste.",
            "Let the water come to a gentle boil on a medium flame.",
            "Switch off the flame. Place the pan on the kitchen counter-top. Add green tea. You can add less or more green tea leaves as you prefer.",
            "Cover the pan with its lid and steep green leaves in the hot water for 3 minutes.",
            "After 3 minutes, pour kahwa tea in small cups using a tea strainer.",
            "Add 3 to 4 saffron strands and sliced almonds in each cup.",
            "Serve kahwa and enjoy this fragrant mild green tea."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "55kcal",
        "carbohydrates": "12g",
        "protein": "1g",
        "fat": "1g"
    },
    
    {
        "id": "20",
        "title": "Methi Chaman",
        "description": "Methi chaman recipe with step by step pics. Methi chaman is a delicious gravy based dish from the Kashmiri pandit cuisine. Methi is fenugreek leaves and chaman is paneer in Kashmiri language. The making of methi chaman can be compared to the Making of palak paneer.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Kashmiri",
        "course": "Main Course",
        "time": "35 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "75 grams methi or 3.5 cups methi leaves (fresh fenugreek leaves)",
            "40 grams palak or about ⅔ to ¾ cup roughly chopped spinach leaves",
            "3 cups water for blanching",
            "2 cups cold water",

            "2 tablespoons mustard oil - can also use sunflower oil or ghee",
            "½ teaspoon cumin seeds",
            "1 inch cinnamon",
            "3 cloves",
            "⅛ teaspoon turmeric powder or 2 pinches",
            "1 teaspoon kashmiri red chilli powder",
            "½ teaspoon dry ginger powder (saunth powder)",

            "½ teaspoon Garam Masala Powder or kashmiri garam masala powder",
            "1 teaspoon coriander powder",
            "1 teaspoon fennel powder",
            "1 pinch of asafoetida (hing)",
            "½ to ⅔ cup water or add as required",
            "salt as required",
            "2 teaspoons sugar or add as per taste",
            "200 grams Paneer",
            "¼ cup low fat cream, 25% to 35% fat or 2 tablespoons heavy whipping cream",
            "¼ teaspoon kasuri methi – optional"
        ],
        
        "procedure": [
            "First rinse both methi leaves and palak leaves in water very well. Drain all the water. Use a colander or strainer while rinsing.",
            "In a pan heat 3 cups water till it starts boiling. Then keep the pan down.",
            "Place the methi and palak leaves in the hot water. Immerse the greens in the hot water and blanch for 2 to 3 minutes.",
            "With the help of pasta tongs, lift the blanched leaves. Place the blanched leaves in cold water. Keep the leaves in cold water for 1 minute.",

            "Again using pasta tongs place the leaves in a blender or grinder jar.",
            "Without adding any water blend to a smooth puree. Keep aside.",

            "Take 2 tablespoons mustard oil in a pan or kadai. Reduce the flame to a low and let the mustard oil begin to smoke.",
            "Then add ½ teaspoon cumin seeds, 1 inch cinnamon and 3 cloves. let the spices splutter.",

            "Now switch off the flame and one by one add the following spice powders – ⅛ teaspoon turmeric powder, ½ teaspoon dry ginger powder, ½ teaspoon garam masala powder (or kashmiri garam masala powder), 1 teaspoon kashmiri red chilli powder, 1 teaspoon coriander powder, 1 teaspoon fennel powder and 1 pinch of asafoetida (hing).",
            "Mix very well.",
            "Add the methi-palak puree. Then switch on the flame and keep it to a low. Mix again.",
            "Season with 2 teaspoons sugar and salt as per taste. mix again.",
            "Add ½ to ⅔ cup water or add as required. You can make the gravy thick or like palak paneer consistency by adding less or more water. Addition of ½ cup water will give a slightly thick gravy in this methi chaman recipe.",
            "Mix the water well with the gravy.",
            "On a medium-low flame simmer the methi gravy.",
            "Simmer for 9 to 10 minutes. The gravy will thicken and you will see oil specks on top. Stir occasionally.",
            "Keep the flame to a low. Then add ¼ cup low fat cream.",
            "Mix the cream with the remaining gravy.",
            "Add paneer cubes. You can even fry paneer cubes in 1 to 2 tablespoons oil and then add.",
            "Mix and then switch off the flame.",
            "Lastly crush ¼ teaspoon kasuri methi. Adding kasuri methi gives a good aroma to the dish. But you can skip if you do not have kasuri methi leaves. Mix again.",
            "Serve methi chaman with roti or naan or paratha. While serving you can top with some cream or some grated paneer."
        ],
        
        "healthPreference": "",
        "calories": "259kcal",
        "carbohydrates": "6g",
        "protein": "8g",
        "fat": "22g"
    },
    
    {
        "id": "21",
        "title": "Lauki Yakhni | Al Yakhni",
        "description": "Lauki yakhni or al yakhni is a dish from Kashmiri pandit cuisine which does not use onion and garlic. Lauki (bottle gourd or opo squash) and yogurt are the main ingredients that go in the making of this Kashmiri dish of lauki yakhni.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Kashmiri",
        "course": "Main Course",
        "time": "30 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "12 to 15 slices of lauki (bottle gourd or opo squash)",
            "1 inch cinnamon (dalchini)",
            "1 to 2 black cardamom (badi elaichi)",
            "½ or ¾ teaspoon shahjeera (caraway seeds)",
            "½ teaspoon dry ginger powder (saunth)",
            "1 teaspoon fennel powder (saunf powder)",
            "1 pinch asafoetida (hing)",
            "1 cup water",
            "¾ or 1 cup Curd (yogurt or dahi - dairy or vegan) - whisked till smooth (i used cashew yogurt)",

            "1 or 2 tablespoon oil for frying the lauki slices",
            "1 tablespoon oil for the yogurt sauce",
            "salt as required",
            "few mint leaves for garnish (optional)"
        ],
        
        "procedure": [
            "Heat oil in a flat pan. Pan fry the lauki slices till they are browned and cooked well.",
            "In the same pan or in another pan, heat oil. If there is leftover oil, then just add some extra oil to the same pan so that it becomes approx 1 tbsp oil.",
            "Add the whole spices - shahjeera, cinnamon,black cardamoms and fry till the oil becomes aromatic.",
            "Now switch off the fire and let the pan stand for 1-2 minutes if its very hot.",
            "Add water.",

            "Be careful when pouring the water as if the oil is very hot, the oil will splutter.",
            "Let the water come to a boil.",
            "Add the fried lauki slices, ginger powder, fennel powder, asafoetida and salt.",
            "Simmer for 2-3 mins. Slowly add the whisked yogurt and continue to stir while adding.",
            "Simmer for 4-5 minutes or till the sauce thickens a bit.",
            "Serve the lauki yakhni with some steamed basmati rice or saffron rice or kashmiri pulav."
        ],
        
        "healthPreference": "",
        "calories": "",
        "carbohydrates": "",
        "protein": "",
        "fat": ""
    },
    
    {
        "id": "22",
        "title": "Jammu Rajma",
        "description": "Jammu rajma is a delicious curry made with dark red kidney beans in an onion-tomato-spice base.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Jammu",
        "course": "Main Course",
        "time": "40 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 cup kashmiri rajma (kidney beans)",
            "2 cups water for pressure cooking",
            "¼ teaspoon salt, optional",

            "1 medium sized onion or 60 grams onions",
            "2 medium to large tomatoes or 170 grams tomatoes",

            "½ teaspoon cumin seeds",
            "½ teaspoon caraway seeds",
            "1 inch cinnamon",
            "2 green cardamoms",
            "3 cloves",
            "seeds of 1 black cardamom",
            "3 single strands of mace (javitri)",
            "⅛ teaspoon nutmeg powder or 1 to 2 pinch of nutmeg powder or grated nutmeg",

            "1 teaspoon Ginger-Garlic Paste",
            "½ teaspoon kashmiri red chilli powder",
            "½ teaspoon coriander powder",
            "salt as required",
            "½ cup water to be added later"
        ],
        
        "procedure": [
            "Rinse and then soak 1 cup kashmiri rajma in enough water overnight or for 8 to 9 hours.",
            "Next day, drain the water. Then rinse the soaked rajma very well in running water. Add the rajma in a pressure cooker along with ¼ teaspoon salt and 2 cups water.",
            "You can also skip the salt if you want at this step and just cook the rajma beans with the water.",
            "Pressure cook the kashmiri rajma beans for 16 to 18 whistles or for 18 to 20 minutes on a medium flame.",
            "The time taken for the rajma beans to cook depends on the age and quality of rajma.",
            
            "When the rajma is cooking, take the whole spices mentioned above (in the ingredient list) and keep aside. Also roughly chop the onions and tomatoes.",
            "In a grinder jar, take the chopped onions, tomatoes and all the whole spices.",
            "Grind to a smooth fine paste without adding any water. Keep the masala paste aside.",
            "When the pressure settles down in the cooker, check the rajma beans, if they have softened.",
            "They should be cooked completely and should not have any firmness or bite in them. If the rajma are not cooked completely, then pressure cook for some more time.",

            "Melt 2 tablespoons ghee in a pan. You can also add 3 tablespoons ghee.",
            "Once the ghee melts, switch off the flame then add the ground onion-tomato-spice paste. This mixture splutters a lot, hence the burner can be switched off or kept on sim or low.",
            "Then cover the pan with a lid and switch on the burner. Keep the flame to a low.",
            "On a low flame cook till the masala paste stops spluttering. Do check when the masala is getting cooked, so that it does not stick to the base of the pan.",
            "When the mixture has stopped spluttering, then remove the lid and add 1 teaspoon ginger-garlic paste.",
            "Next add ½ teaspoon kashmiri red chilli powder and ½ teaspoon coriander powder.",
            "Mix everything very well and saute the masala paste till you see ghee releasing from the sides.",
            "Saute on a low or medium-low flame and stir often. The masala paste should thicken, leaves sides of the pan and you will see ghee being released at the sides.",
            "Once the masala paste is sautéed well and you see ghee at the sides, then add the cooked kashmiri rajma beans along with its stock - the water in which the rajma beans was cooked.",
            "Stir and mix well. Season with salt as per taste.",
            "Now add ½ cup water. You can add water as required. Mix again.",
            "On a medium flame bring the curry to a boil. Also mash some rajma beans. This will help to thicken the rajma curry.",
            "The consistency of the curry should not be watery or broth like. It should be smooth and have a medium consistency. Switch off the flame.",
            "Serve jammu rajma on a bed of steamed rice and top with some ghee. If you want you can garnish with some coriander leaves."
        ],
        
        "healthPreference": "",
        "calories": "192kcal",
        "carbohydrates": "36g",
        "protein": "12g",
        "fat": "1g"
    },
    
    {
        "id": "23",
        "title": "Thekua",
        "description": "Thekua are crisp crunchy cookies flavored with traditional Indian spices. These delicious fennel and cardamom scented deep fried cookies are a family favorite. If crunchy cookies are your preference, try this traditional Indian recipe today!",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Sweets",
        "time": "40 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "1.25 cup whole wheat flour – 155 to 160 grams",
            "1 pinch salt",
            "1 teaspoon fennel seeds (saunf)",
            "1 tablespoon fresh grated coconut or desiccated coconut",
            "½ teaspoon cardamom powder or 4 to 5 green cardamoms crushed in mortar-pestle",
            "3 tablespoons Ghee – 25 grams",
            "½ cup chopped Jaggery or about 85 grams",
            "¼ cup water or add as required",
            "1.5 cups oil – for deep frying, any neutral tasting oil"
        ],
        
        "procedure": [
            "Take the wheat flour, salt, fennel seeds, grated coconut and cardamom powder in a mixing bowl. Mix well and set aside.",
            "In small bowl or pan, melt ghee until hot.",
            "Add this hot ghee into the dry ingredients and mix with a spoon.",
            "Then using your fingers mix the ghee with the flour till you get a breadcrumb consistency. When you press the mixture it should form a lump.",
            "In a saucepan take jaggery and water.",
            "Heat until all the jaggery melts.",
            "Add hot jaggery solution in parts to the flour and mix with a spoon first.",
            "Keep on adding in parts and mixing and then begin to bring the dough together and knead lightly.",
            "Make a firm or semi-soft dough.",
            "Cover the dough with a kitchen towel and rest for 15 minutes.",

            "Later make small balls from the dough.",
            "Lightly flatten the dough balls with your palms or with a rolling pin.",
            "Press the flattened discs with a peda maker, cookie design press or using a toothpick, fork or bamboo skewers make design patterns.",
            "Keep covered with a kitchen napkin or kitchen towel.",

            "Heat 1.5 cups oil in a kadai or wok.",
            "Add a small piece of dough in the oil. If it is comes up gradually on top, the oil is hot.",
            "Keep the heat to a medium-low and place the discs in hot oil.",
            "When one side is golden, gently turn over and fry the second side. Be very careful when turning and do it gently with a dinner spoon so that they do not break.",
            "Fry till golden and crisp. Due to jaggery these have a deeper golden color.",
            "Place on kitchen paper towels.",

            "When cooled at room temperature store in an airtight container.",
            "Serve thekua as a tea time cookie."
        ],
        
        "healthPreference": "",
        "calories": "85kcal",
        "carbohydrates": "11g",
        "protein": "1g",
        "fat": "4g"
    },
    
    {
        "id": "24",
        "title": "Sattu Ladoo",
        "description": "Sattu ladoo recipe - quick and easy sattu ladoo made from roasted chana flour, jaggery and ghee.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Sweets",
        "time": "15 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "1 cup heaped sattu flour",
            "½ cup jaggery powder or grated jaggery",
            "3 tablespoons Ghee (clarified butter)",
            "¼ teaspoon cardamom powder (choti elaichi powder)"
        ],
        
        "procedure": [
            "Heat 1 tablespoon ghee in a kadai or pan.",
            "Then add 1 heaped cup sattu flour. Mix the flour with the ghee and begin to roast sattu flour on a low flame.",
            "Stir often while roasting. The sattu just needs to be lightly roasted. Roast sattu for 2 minutes on a low flame.",
            "Remove in a separate bowl.",

            "Add 1/2 cup jaggery powder. You can also add grated jaggery. Even powdered sugar can be used.",
            "Add 1/4 teaspoon cardamom powder.",
            "Mix very well.",
            "Then add 2 tablespoons ghee. The ghee can be at room temperature.",
            "Begin to mix very well. If there are small granules in the jaggery powder, then you can just run the ladoo mixture in the mixer-grinder till the mixture becomes smooth. Or you can run the jaggery powder in the mixer before you add to the sattu flour.",
            "Shape into ladoos while the mixture is still warm. If you are unable to form ladoos, then add a few teaspoons more of the ghee.",
            "Serve sattu laddu as a sweet snack. These ladoos stay good at room temperature for a week. If its too hot and humid in your city, then do refrigerate these ladoos."
        ],
        
        "healthPreference": "",
        "calories": "85kcal",
        "carbohydrates": "11g",
        "protein": "1g",
        "fat": "4g"
    },
    
    {
        "id": "25",
        "title": "Litti Chokha",
        "description": "Litti chokha is a rustic and traditional dish of stuffed whole wheat dough balls, where the stuffing is a spiced mix of roasted gram flour or sattu.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Main Course",
        "time": "1 hour 45 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "2 cups whole wheat flour or 240 grams whole wheat flour",
            "¼ teaspoon salt",
            "1 tablespoon Ghee or oil",
            "¾ to 1 cup water or add as required",

            "1 cup sattu (roasted gram flour)",
            "½ teaspoon cumin seeds",
            "½ teaspoon saunf (fennel seeds or aniseeds)",
            "½ teaspoon ajwain (carom seeds or bishops weed)",
            "½ teaspoon nigella seeds (kalonji or onion seeds)",
            "½ teaspoon red chilli powder",
            "1 to 2 teaspoons chopped green chilies",
            "1 teaspoon finely chopped ginger",
            "1 teaspoon finely chopped garlic",
            "2 tablespoons chopped coriander leaves",
            "¼ teaspoon black salt",
            "regular salt as per taste",
            "2 teaspoons lemon juice",
            "2 teaspoons mustard oil",
            "1 to 2 tablespoons of water or add as required",

            "baingan chokha",
            "tomato chokha",
            "aloo chokha",
            "¼ cup melted ghee or use as required"
        ],
        
        "procedure": [
            "In a mixing bowl, take 2 cups whole wheat flour/atta (240 grams) and 1/4 teaspoon salt. Also add 1 tablespoon ghee or oil.",
            "Now add water in parts and knead to a smooth soft dough. I added 3/4 cup water. Depending on the quality of flour, you can add 3/4 to 1 cup water.",
            "Knead till smooth and soft. Cover the dough and keep aside.",

            "In a mortar-pestle take 1/2 teaspoon cumin seeds and 1/2 teaspoon saunf (fennel seeds). Lightly crush them and keep aside.",
            "Take 1 cup sattu/roasted gram flour in a mixing bowl or pan.",
            "Add the slightly crushed cumin seeds and fennel seeds.",

            "Now add 1/2 teaspoon ajwain, 1/2 teaspoon nigella seeds and 1/2 teaspoon red chilli powder, 1 to 2 teaspoons chopped green chilies, 1 teaspoon finely chopped ginger, 1 teaspoon finely chopped garlic, 2 tablespoons chopped coriander leaves and 1/4 teaspoon black salt. Also add regular salt as per taste.",
            "Also add 2 teaspoons lemon juice and 2 teaspoons mustard oil",
            "Mix very well.",
            "Sprinkle 1 to 2 tablespoons water all over and mix the flour with water evenly. Do add more water if required. The sattu stuffing mixture should not be too dry or too wet. If the mixture is dry, then the dryness is felt when eating littis.",

            "After 30 minutes, now make small or medium sized balls from the dough.",
            "Sprinkling some flour, roll each dough ball to a circle of about 5 to 6 inches.",
            "Place 2 to 3 tablespoons of the stuffing in the center.",
            "Pleat and then join the edges. Press the joined part and lightly roll the stuffed dough balls in your palms, so as to get a round shape. Keep aside.",
            "Another method is to flatten the the dough ball with your palms and make a shallow cup.",
            "Now place the stuffing.",
            "Gently bring together the outer dough cover in the center, while pressing the stuffing. Join and then seal the edges. This is a bit tricky method. So please use the method which suits you.",
            "Keep the prepared littis under a cotton towel or napkin, so that the dough does not dry out.",
            "Prepare all stuffed littis this way and place them on a baking tray, which has been greased with some oil. Do grease baking tray well, otherwise the littis can stuck to the tray.",

            "Place the littis in a preheated oven at 200 degrees celsius. Preheat the oven for 20 minutes at 200 degree celsius prior to baking.",
            "After 10 to 15 minutes of baking, remove the tray and flip each litti. Keep the tray back in the oven.",
            "Again after 10 to 15 minutes, remove the baking tray and flip each litti. Place the tray back in the oven. This has to be done once or twice more for even baking of littis.",
            "Bake till the crust looks done with some light brown or golden brown spots on them. Timing will vary upon the size and litres of oven. It took me about 45 minutes for these to bake.",
            "Brush the littis with some melted ghee all over.",
            "This step is optional and only to get charred spots on the litti. Secure the litti in a pair of tongs and place it on fire. Rotate for a few seconds till you see some charred spots on littis.",
            "Serve these bihari style litti with baingan chokha, aloo chokha and tamatar chokha accompanied with a small bowl of melted ghee. The litti is broken, dipped in ghee and then had with the chokha.",

            "Rinse 1 large baingan/eggplant/aubergine (420 grams) in water. Place it on a wired rack on a stove top or you can place it directly on fire.",
            "Keep turning the eggplant after 2 to 3 minutes on the flame, so that its evenly cooked.",
            "Roast the baingan till its completely cooked and tender. With a knife check the doneness. The knife should slid easily in baingan without any resistance. Remove the baingan and immerse in a bowl of water till it cools down.",
            "Then peel it and chop.",
            "Add the chopped baingan in a mixing bowl along with its juices.",
            "Then add ⅓ cup chopped onions, ½ teaspoon chopped green chilies, ½ teaspoon chopped garlic and 1 to 2 tablespoons chopped coriander leaves.",
            "Add 1 teaspoon mustard oil. If you want, you can add ¼ to ½ teaspoon lemon juice for a slight tang. Season with salt.",
            "Mix everything very well.",

            "Rinse 2 medium to large tomatoes (200 grams) very well in water first. Then place them on a wired grill rack and begin to roast the tomatoes. You can also place them directly on the stove top. You can also grill the tomatoes or roast in the oven. But then you won't get the smoky flavor.",
            "Turn them after a few minutes for even roasting. The tomatoes should get charred.",
            "Roast the tomatoes till they are completely cooked from within. With a knife check the doneness. The knife should slid easily in the tomatoes without any resistance.",
            "Once the tomatoes cool, then peel them and remove the charred skin. Chop them and add the chopped tomatoes along with its juices in a mixing bowl.",
            "Add ½ teaspoon chopped green chilies, ½ teaspoon chopped garlic, 1 tablespoon chopped coriander leaves, ½ teaspoon mustard oil and ½ teaspoon lemon juice.",
            "Season with salt as per taste. Mix very well.",
            "Check the taste and add more lemon juice or mustard oil or green chilies or salt if required.",

            "First boil or steam 2 medium potatoes (160 grams) till they are thoroughly cooked. Allow them to become warm. You can steam them in a pan or electric rice cooker or pressure cook them in 1.25 to 1.5 cups water for 5 to 6 whistles.",
            "When the potatoes become warm, peel and mash them.",
            "Add ⅓ cup chopped onion, ½ teaspoon chopped green chilies, ½ teaspoon finely chopped garlic, ½ teaspoon mustard oil and ½ teaspoon lemon juice.",
            "Mix very well. Check the taste and add more salt, lemon juice or green chilies if required."
        ],
        
        "healthPreference": "",
        "calories": "",
        "carbohydrates": "",
        "protein": "",
        "fat": ""
    },
    
    {
        "id": "26",
        "title": "Baingan Ka Chokha",
        "description": "Baingan chokha is a delicious fire roasted mashed eggplant dish that is served with littis or sattu ka paratha",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Side Dish",
        "time": "15 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "420 grams large eggplant (baingan) or 1 large bharta baingan",
            " ⅓ cup chopped onions or 1 medium onion - chopped or 50 grams onion",
            " ½ teaspoon chopped green chilies",
            " ½ teaspoon chopped garlic",
            " 1 to 2 tablespoons chopped coriander leaves (cilantro leaves)",
            " 1 teaspoon mustard oil",
            " ¼ to ½ teaspoon lemon juice (optional)",
            "salt as required"
        ],
        
        "procedure": [
            "Rinse the baingan (eggplant) in water. Place it on a wired rack on a stove top or you can place it directly on fire.",
            "Keep turning the eggplant after 2 to 3 minutes on the flame, so that its evenly cooked.",
            "Roast the baingan till its completely cooked and tender.",
            "With a knife check the doneness. The knife should slid easily in baingan without any resistance. Remove the baingan and immerse in a bowl of water till it cools down.",
            "Then peel it and chop.",

            "Add the chopped baingan in a mixing bowl along with its juices.",
            "Then add 1/3 cup chopped onions, 1/2 teaspoon chopped green chilies, 1/2 teaspoon chopped garlic and 1 to 2 tablespoons chopped coriander leaves.",
            "Add 1 teaspoon mustard oil. If you want, you can add 1/4 to 1/2 teaspoon lemon juice for a slight tang.",
            "Season with salt. Mix everything very well.",
            "Serve baingan ka chokha with litti chokha or rotis."
        ],
        
        "healthPreference": "",
        "calories": "56kcal",
        "carbohydrates": "10g",
        "protein": "1g",
        "fat": "4g"
    },
    
    {
        "id": "27",
        "title": "Sattu Ka Ghol",
        "description": "Namkeen sattu is a savory summer drink made with roasted black chickpeas flour, black salt, herbs & spices.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Beverages",
        "time": "5 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "750 ml chilled water",
            "4 tablespoon sattu (roasted black chickpea flour)",
            "½ teaspoon black salt or add as required",
            "½ teaspoon roasted cumin powder (bhuna jeera powder)",
            "¼ teaspoon black pepper powder (kali mirch powder) - optional",
            "3 teaspoon lemon juice or juice of 1 small lemon or lime",
            "2 teaspoon chopped coriander leaves (dhania patta)",
            "2 teaspoon chopped mint leaves (pudina patta)"
        ],
        
        "procedure": [
            "In a mug or pan, add 4 tbsp sattu.",
            "Add 1/2 tsp roasted cumin powder.",
            "Add 3 tsp lemon juice.",
            "Add 1/2 tsp black salt.",
            "Pour 750 ml chilled water.",
            "With a spoon, stir and mix well. Break small lumps if any with the spoon.",
            "Lastly add 2 tsp each of chopped mint and coriander leaves. You can skip one of them, if you do not have. You can also add green chilies and finely chopped onions if you prefer. You can also add black pepper powder.",
            "Pour in glasses and serve sattu drink. You can also keep in refrigerator and then serve later."
        ],
        
        "healthPreference": "",
        "calories": "",
        "carbohydrates": "",
        "protein": "",
        "fat": ""
    },
    
    {
        "id": "28",
        "title": "Aloo Chokha",
        "description": "Aloo ka chokha is spiced mashed potatoes dish from the Bihari cusine.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Side Dish",
        "time": "20 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "2 medium potatoes or 160 grams of potatoes",
            "⅓ cup chopped onion or 1 medium onion - chopped or 50 grams onion",
            "½ teaspoon chopped green chilies",
            "2 to 3 teaspoons chopped coriander leaves (cilantro leaves)",
            "½ teaspoon finely chopped garlic",
            "½ teaspoon mustard oil",
            "½ teaspoon lemon juice",
            "salt as required"
        ],
        
        "procedure": [
            "First boil or steam 2 medium potatoes (160 grams) till they are thoroughly cooked. Allow them to become warm. You can steam them in a pan or electric rice cooker or pressure cook them in 1.25 to 1.5 cups water for 5 to 6 whistles.",
            "When the potatoes become warm, peel and mash them.",
            "Add 1/3 cup chopped onion, 1/2 teaspoon chopped green chilies, 1/2 teaspoon finely chopped garlic, 2 teaspoon chopped coriander leaves, 1/2 teaspoon mustard oil and 1/2 teaspoon lemon juice.",
            "Mix very well. Check the taste and add more salt, lemon juice or green chilies if required.",
            "Serve aloo chokha with litti chokha or as a side dish with any north indian meal."
        ],
        
        "healthPreference": "",
        "calories": "68kcal",
        "carbohydrates": "12g",
        "protein": "2g",
        "fat": "1g"
    },
    
    {
        "id": "29",
        "title": "Ghugni",
        "description": "This is a Bihari style ghugni recipe which is a delicious curry made with black or brown chickpeas. The recipe comes from the Bihari cuisine.",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Main Course",
        "time": "8 hours 20 mins",
        "difficultyLevel": "Easy",
        
        "ingridients": [
            "1 cup black chickpeas or 200 grams black chickpeas (kala chana)",
            "2 tablespoons mustard oil",
            "½ teaspoon cumin seeds",
            "1 tej patta (indian bay leaf)",
            "1 inch cinnamon",
            "2 cloves - optional",
            "150 grams onions or 2 medium to large onions or 1.3 cups finely chopped onions",
            "160 grams tomatoes or 2 medium to large tomatoes or 1 cup finely chopped tomatoes",
            "½ teaspoon Ginger-Garlic Paste",
            "½ teaspoon turmeric powder",
            "½ teaspoon red chilli powder",
            "1 teaspoon cumin powder",
            "1 tablespoon coriander powder",
            "½ teaspoon Garam Masala Powder",
            "salt as required",
            "2 cups water for pressure cooking",
            
            "⅓ cup finely chopped onions",
            "1 to 2 green chilies - finely chopped",
            "⅓ cup chopped coriander leaves (cilantro leaves)",
            "1 medium sized lemon or lime"
        ],
        
        "procedure": [
            "Rinse black chickpeas with water a couple of times. Then soak the black chickpeas overnight or for 7 to 8 hours in enough water. Drain the water and keep the chickpeas aside.",

            "In a pressure cooker, heat 2 tablespoons mustard oil. Once the mustard oil begins to smoke, then lower the flame.",
            "Add ½ teaspoon cumin seeds, 1 tej patta, 1 inch cinnamon and 2 cloves (optional). The oil will be hot and the spices will crackle in fraction of seconds.",
            "Then immediately add 1.3 cups finely chopped onions.",
            "Saute onions till they turn light brown.",
            "Next add ½ teaspoon ginger-garlic paste and saute till their raw aroma goes away.",
            "Next add 1 cup finely chopped tomatoes.",
            "Saute till the tomatoes turn mushy and you see oil releasing from the sides of the onion-tomato masala.",
            "Now add all the spice powders one by one - ½ teaspoon turmeric powder, ½ teaspoon red chilli powder, 1 teaspoon cumin powder and 1 tablespoon coriander powder.",
            "Mix the spice powders very well with the onion-tomato base.",
            "Add the soaked kala chana and mix them very well with the masala.",
            "Now add 2 cups water.",
            "Season with salt and mix well.",
            "Pressure cook on medium flame for 15 to 20 minutes or till the chana is cooked. The time of cooking will vary on the quality of chana. In case the chana is not cooked, then continue to pressure cook for some more minutes.",
            "Once the pressure settles down on its own, remove the lid and keep the cooker on stove top. Simmer the ghugni gravy on a low to medium flame till it thickens slightly. Mash some chana pieces with the spoon as this helps in thickening the gravy.",
            "Once the ghugni gravy has thickened to a medium consistency, add ½ teaspoon garam masala powder and mix very well. Switch off the flame.",
            "Serve kala chana ghugni garnished with some finely chopped onion, chopped coriander leaves, finely chopped green chilies and drizzled with some lemon juice. You can also accompany a simple mix of ⅓ cup finely chopped onions, 1 or 2 green chilies (chopped), ¼ cup coriander leaves and lemon wedges. Serve ghugni with chapatis, pooris or with steamed rice."
        ],
        
        "healthPreference": "",
        "calories": "68kcal",
        "carbohydrates": "12g",
        "protein": "2g",
        "fat": "1g"
    },
    
    {
        "id": "30",
        "title": "Dal Pitha",
        "description": "Bihari Dal Pitha Recipe (Traditional Bihari Delicacy) is a popular rice flour dumplings in Bihari Cuisine. Pithas are either stuffed with sweet or spicy filling. Bihari Dal Pitha is prepared using fresh rice flour and spicy masala lentil filling. Pithas served along with Hari Dhaniya ki Chutney, Tomato Chutney or Mint Chutney can be a delightful starter or a specialty dinner option. ",
        
        "backgroundImg": "",
        "procedureVideo": "",
        
        "category": "Veg",
        "cusine": "Bihari",
        "course": "Snack",
        "time": "70 mins",
        "difficultyLevel": "Moderate",
        
        "ingridients": [
            "1 cup Rice , soaked for 4 hours or 1/2 cup rice flour",
            "1 teaspoon Oil",
            "1 pinch Salt",
            "Water , to cook",

            "3/4 cup Chana dal (Bengal Gram Dal) , soaked for 3 hours",
            "2 Green Chillies , chopped",
            "1 inch Ginger , peeled and chopped",
            "3 cloves Garlic",
            "1/2 teaspoon Cumin seeds (Jeera)",
            "1/4 teaspoon Whole Black Peppercorns",
            "1/2 teaspoon Ajwain (Carom seeds)",
            "1 teaspoon Oil",
            "Salt , to taste",
            "Coriander (Dhania) Leaves , finely chopped for garnish",
            "1 teaspoon Oil , for greasing"
        ],
        
        "procedure": [
            "To prepare Bihari Dal Pitha Recipe (Traditional Bihari Delicacy), first gather all the ingredients.",

            "Grind the soaked rice to a smooth paste using water (approximately 1/2 cup)",
            "Dilute the ground batter by adding water (approximately 1.5 - 2 cups) to get a thin batter consistency.",
            "Add salt and oil to the batter and mix well.",
            "Transfer the batter to a heavy bottom kadai or vessel and start cooking over low heat.",
            "Keep stirring the batter to prevent lumps and cook the rice flour batter till it turns into a soft dough. It might look as if the dough is turning lumpy and sticking to the ladle, but keep stirring till the entire batter cooks. This step will take at least 12 -15 minutes over low flame.",

            "Drain the excess water from soaked dal and grind dal along with green chillies, ginger, garlic, salt, carom seeds cumin seeds and pepper corns to make a coarse paste.",
            "Heat a kadai/wok over low flame, with a teaspoon of oil and add the ground paste.",
            "Keep stirring till the dal cooks well and they get a powdered/crumbly texture. This step will approximately take 7-10 minutes.",
            "Switch off and add the chopped cilantro leaves. Your stuffing for Bihari Dal Pitha is now ready.",
            "Instruction to shape Pithas",
            "Grease a steamer vessel with oil. Grease your hands with oil and take lemon size portions of the rice dough and using your hand shape them into balls. Work when the rice dough is still warm for better result. Keep the rice dough covered with a damp cloth or a lid to keep it moist while you are making balls.",
            "Taking one ball at a time, pinch the corners and shape the balls to make a cup and spoon the dal stuffing. You can also use gujiya mould to shape the pithas. Also can shape the pithas like dimsums/wontons /kozhukattai/modak .",
            "Seal gently by pinching the ends using greased fingers.",
            "Repeat the same for the entire batch.",
            "Place the pithas in the greased steamer and steam them for 8-10 minutes. You can also cook the pitha by dunking them in boiling hot water. Cook till they rise up to the surface, drain and serve. Make sure to seal the pithas properly to avoid leakage.",
            "Your delicious, healthy Bihar Dal Pitha Recipe (Traditional Bihari Delicacy) is ready to be served hot along with your choice of chutneys or sauces to make a yummy spicy filling tea-time snack."
        ],
        
        "healthPreference": "Gluten Free",
        "calories": "",
        "carbohydrates": "",
        "protein": "",
        "fat": ""
    },
]
